export const ALGERIA_WILAYAS = [
  '43 - ميلة',
  '16 - الجزائر',
  '09 - البليدة',
  '31 - وهران',
  '25 - قسنطينة',
  '23 - عنابة',
  '19 - سطيف'
];

export const MUNICIPALITIES: Record<string, string[]> = {
  '43 - ميلة': [
    'ميلة', 'القرارم قوقة', 'سيدي مروان', 'الشيقارة', 'زغاية', 'وادي النجاء', 'أحمد راشدي', 
    'تسدان حدادة', 'مينار زرزة', 'ترعي باينان', 'عميرة أراس', 'فرجيوة', 'يحيى بني قشة', 
    'بوحاتم', 'دراع بوينداس', 'الرواشد', 'تيبرقنت', 'وادي إندجا', 'شلاغوم العيد', 'تاجنانت', 
    'بئر الشهداء', 'المشيرة', 'التلاغمة', 'وادي سقان', 'عين الملوك', 'وادي العثمانية', 
    'خير الدين', 'سيدي خليفة', 'مراس أراس', 'الرواشد', 'تسالة لمطاعي'
  ],
  '16 - الجزائر': ['الجزائر الوسطى', 'سيدي امحمد', 'المدنية', 'الحراش', 'باب الزوار', 'بئر مراد رايس', 'بن عكنون', 'القبة', 'زرالدة', 'الشراقة', 'الرويبة'],
  '09 - البليدة': ['البليدة', 'بوفاريك', 'الشفة', 'موزاية', 'العفرون', 'الاربعاء', 'مفتاح'],
  '31 - وهران': ['وهران', 'بئر الجير', 'السانية', 'ارزیو', 'قديل', 'مسرغين'],
  '25 - قسنطينة': ['قسنطينة', 'الخروب', 'علي منجلي', 'عين سمارة', 'حامة بوزيان', 'زيغود يوسف'],
  '23 - عنابة': ['عنابة', 'البوني', 'سيدي عمار', 'الحجار', 'برحال'],
  '19 - سطيف': ['سطيف', 'العلمة', 'عين ولمان', 'عين ارنات', 'بوقاعة', 'صالح بياشير']
};
